public_html/Embedded System/Filesystem Overview.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Filesystem OverView</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Filesystem OverView"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-09-09 15:16:53 HKT"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Filesystem OverView</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">General</a>
<ul>
<li><a href="#sec-1-1">arago main page</a></li>
<li><a href="#sec-1-2">busybox</a></li>
<li><a href="#sec-1-3">ubuntu</a></li>
<li><a href="#sec-1-4">OpenEmbedded</a></li>
<li><a href="#sec-1-5">Poky Linux</a></li>
<li><a href="#sec-1-6">Root File system solutions</a></li>
<li><a href="#sec-1-7">Creating a Root File System for Linux on OMAP35x</a></li>
<li><a href="#sec-1-8">Initrd</a></li>
</ul>
</li>
<li><a href="#sec-2">Modify</a>
<ul>
<li><a href="#sec-2-1">Using The Correct Console Device</a></li>
</ul>
</li>
<li><a href="#sec-3">Arago</a>
<ul>
<li><a href="#sec-3-1">Setting Up Build Environment and build</a>
<ul>
<li><a href="#sec-3-1-1">ubuntu install dependency</a></li>
<li><a href="#sec-3-1-2">Create the directory</a></li>
<li><a href="#sec-3-1-3">Clone Arago repositories</a></li>
<li><a href="#sec-3-1-4">Copy setup/config files</a></li>
<li><a href="#sec-3-1-5">Set the environment variables</a></li>
<li><a href="#sec-3-1-6">Point to CSL toolchain</a></li>
<li><a href="#sec-3-1-7">Build a minimal base filesystem</a></li>
<li><a href="#sec-3-1-8">Build a "demo" filesystem for OMAP3 EVM</a></li>
<li><a href="#sec-3-1-9">Build different kernels for supported platforms</a></li>
<li><a href="#sec-3-1-10">High-level hierarchy of arago-deploy directory</a></li>
<li><a href="#sec-3-1-11">Build individual package recipes</a></li>
<li><a href="#sec-3-1-12">build a native compiler (on dm8168) using</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-4">Host and Target</a></li>
<li><a href="#sec-5">Notes</a>
<ul>
<li><a href="#sec-5-1">Creating a Root File System for Linux on OMAP35x</a>
<ul>
<li><a href="#sec-5-1-1">create the directory</a></li>
<li><a href="#sec-5-1-2">Configure the Linux Kernel to Support File Systems</a></li>
<li><a href="#sec-5-1-3">Download and Build BusyBox</a></li>
<li><a href="#sec-5-1-4">Configure the New Target Root File System</a></li>
<li><a href="#sec-5-1-5">Add the Shared Libraries Applications will Require</a></li>
<li><a href="#sec-5-1-6">Mounting the Root File System over NFS</a></li>
<li><a href="#sec-5-1-7">Enhancing the Root File System</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">General</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">arago main page</h3>
<div class="outline-text-3" id="text-1-1">

<p><a href="http://arago-project.org/wiki/index.php/Main_Page">http://arago-project.org/wiki/index.php/Main_Page</a>
</p></div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">busybox</h3>
<div class="outline-text-3" id="text-1-2">

<p><a href="http://www.busybox.net/">http://www.busybox.net/</a>
</p></div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">ubuntu</h3>
<div class="outline-text-3" id="text-1-3">

<p><a href="https://wiki.ubuntu.com/ARM/RootfsFromScratch">https://wiki.ubuntu.com/ARM/RootfsFromScratch</a>
</p></div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4">OpenEmbedded</h3>
<div class="outline-text-3" id="text-1-4">

<p><a href="http://www.openembedded.org/wiki/Main_Page">http://www.openembedded.org/wiki/Main_Page</a>
</p></div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5">Poky Linux</h3>
<div class="outline-text-3" id="text-1-5">

<p><a href="http://www.pokylinux.org/">http://www.pokylinux.org/</a>
</p></div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6">Root File system solutions</h3>
<div class="outline-text-3" id="text-1-6">

<p><a href="http://processors.wiki.ti.com/index.php/Linux_Toolchain#Root_File_System_solutions">http://processors.wiki.ti.com/index.php/Linux_Toolchain#Root_File_System_solutions</a>
</p>
</div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7">Creating a Root File System for Linux on OMAP35x</h3>
<div class="outline-text-3" id="text-1-7">

<p><a href="http://processors.wiki.ti.com/index.php/Creating_a_Root_File_System_for_Linux_on_OMAP35x">http://processors.wiki.ti.com/index.php/Creating_a_Root_File_System_for_Linux_on_OMAP35x</a>
</p></div>

</div>

<div id="outline-container-1-8" class="outline-3">
<h3 id="sec-1-8">Initrd</h3>
<div class="outline-text-3" id="text-1-8">

<p><a href="http://processors.wiki.ti.com/index.php/Initrd">http://processors.wiki.ti.com/index.php/Initrd</a>
</p>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Modify</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">Using The Correct Console Device</h3>
<div class="outline-text-3" id="text-2-1">

<p> update the <code>/etc/inittab</code> file in the filesystem used for kernel 
</p>


<pre class="src src-sh">S:2345:respawn:/sbin/getty 115200 ttyS2
by,
S:2345:respawn:/sbin/getty 115200 ttyO2
</pre>


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Arago</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1">Setting Up Build Environment and build</h3>
<div class="outline-text-3" id="text-3-1">


</div>

<div id="outline-container-3-1-1" class="outline-4">
<h4 id="sec-3-1-1">ubuntu install dependency</h4>
<div class="outline-text-4" id="text-3-1-1">




<pre class="src src-sh">sudo apt-get install diffstat texi2html chrpath subversion python-psyco 
</pre>

</div>

</div>

<div id="outline-container-3-1-2" class="outline-4">
<h4 id="sec-3-1-2">Create the directory</h4>
<div class="outline-text-4" id="text-3-1-2">

<p>Create a new directory for the build environment:
</p>


<pre class="src src-sh">$ mkdir $<span style="color: #eedd82;">HOME</span>/oe
$ cd $<span style="color: #eedd82;">HOME</span>/oe
</pre>

</div>

</div>

<div id="outline-container-3-1-3" class="outline-4">
<h4 id="sec-3-1-3">Clone Arago repositories</h4>
<div class="outline-text-4" id="text-3-1-3">

<p>Now check out the following repositories:
</p>


<pre class="src src-sh">$ git clone git://arago-project.org/git/arago.git
$ git clone git://arago-project.org/git/arago-oe-dev.git
$ git clone git://arago-project.org/git/arago-bitbake.git
</pre>

<p>
The directory should now be populated with 3 subdirectories – <code>arago</code>, <code>arago-oe-dev</code> and <code>arago-bitbake</code>.
</p></div>

</div>

<div id="outline-container-3-1-4" class="outline-4">
<h4 id="sec-3-1-4">Copy setup/config files</h4>
<div class="outline-text-4" id="text-3-1-4">

<p>Arago repository comes with samples of arago/setenv and
arago/conf/local.conf files, which you can use as a starting point, by
copying them into their actual names (without .sample extension) and
modifying to suit your needs:
</p>


<pre class="src src-s">$ cp arago/setenv.sample arago/setenv
$ cp arago/conf/local.conf.sample arago/conf/local.conf
</pre>


<ul>
<li>File: <code>arago/setenv</code>
  Edit <code>arago/setenv</code> file and make sure environment variables are set
  properly. OEBASE should point to the directory you’ve created in the
  beginning:
</li>
</ul>




<pre class="src src-sh"><span style="color: #b0c4de;">export</span> <span style="color: #eedd82;">OEBASE</span>=$<span style="color: #eedd82;">HOME</span>/oe
</pre>

<ul>
<li>File: <code>arago/setenv</code>
  Also, in order to use a separate "scratch" area outside of home
  directory, you may want to enable SCRATCH variable and point it
  appropriately:
</li>
</ul>




<pre class="src src-sh"><span style="color: #b0c4de;">export</span> <span style="color: #eedd82;">SCRATCH</span>=/sim/scratch_AID
</pre>


</div>

</div>

<div id="outline-container-3-1-5" class="outline-4">
<h4 id="sec-3-1-5">Set the environment variables</h4>
<div class="outline-text-4" id="text-3-1-5">




<pre class="src src-sh">$ . arago/seten
</pre>

<p>
Or, 
</p>


<pre class="src src-sh">$ source arago/setenv
</pre>

</div>

</div>

<div id="outline-container-3-1-6" class="outline-4">
<h4 id="sec-3-1-6">Point to CSL toolchain</h4>
<div class="outline-text-4" id="text-3-1-6">

<p>If not done before, set the PATH variable to point to the CodeSourcery
toolchain (refer to <a href="http://www.mentor.com/embedded-software/codesourcery">Getting CodeSourcery Toolchain</a>(<a href="http://www.mentor.com/embedded-software/sourcery-tools/sourcery-codebench/lite/?cmpid=7108&amp;lite=arm&amp;target_os=GNU/Linux&amp;target_arch=ARM&amp;returnURL=https%3A%2F%2Fsourcery.mentor.com%2FGNUToolchain%2Frelease858%3Flite%3Darm%26cmpid%3D7108">The binary distribution for 2009q1-203 version</a>) for obtaining one):
</p>



<pre class="src src-sh">$ export <span style="color: #eedd82;">PATH</span>=/opt/arm-2009q1/bin:$<span style="color: #eedd82;">PATH</span>
</pre>


</div>

</div>

<div id="outline-container-3-1-7" class="outline-4">
<h4 id="sec-3-1-7">Build a minimal base filesystem</h4>
<div class="outline-text-4" id="text-3-1-7">

<p>Now it should be ready to start a build of the minimal filesystem
image:
</p>


<pre class="src src-sh">$ bitbake arago-base-image
</pre>

</div>

</div>

<div id="outline-container-3-1-8" class="outline-4">
<h4 id="sec-3-1-8">Build a "demo" filesystem for OMAP3 EVM</h4>
<div class="outline-text-4" id="text-3-1-8">




<pre class="src src-sh">$ <span style="color: #eedd82;">MACHINE</span>=omap3evm bitbake arago-console-image
</pre>

</div>

</div>

<div id="outline-container-3-1-9" class="outline-4">
<h4 id="sec-3-1-9">Build different kernels for supported platforms</h4>
<div class="outline-text-4" id="text-3-1-9">




<pre class="src src-sh">$ <span style="color: #eedd82;">MACHINE</span>=omap3evm bitbake virtual/kernel
$ <span style="color: #eedd82;">MACHINE</span>=beagleboard bitbake virtual/kernel
$ <span style="color: #eedd82;">MACHINE</span>=dm6446-evm bitbake virtual/kernel
$ <span style="color: #eedd82;">MACHINE</span>=dm355-evm bitbake virtual/kernel
</pre>

</div>

</div>
