public_html/Embedded System/Filesystem Overview.html

<div id="outline-container-3-1-10" class="outline-4">
<h4 id="sec-3-1-10">High-level hierarchy of arago-deploy directory</h4>
<div class="outline-text-4" id="text-3-1-10">

<p>Resulting images and packages will be placed under <code>arago-deploy</code>
directory - <code>images</code> for the filesystem, kernel and bootloader; and <code>ipk</code>
for binary IPK packages, respectively.
</p>



<pre class="src src-sh">arago-deploy
|-- images
|   |-- arago
|   |-- dm355-evm
|   |-- dm6446-evm
|   <span style="color: #fa8072;">`-- omap3evm</span>
<span style="color: #fa8072;">|-- ipk</span>
<span style="color: #fa8072;">|   |-- all</span>
<span style="color: #fa8072;">|   |-- arago</span>
<span style="color: #fa8072;">|   |-- armv5te</span>
<span style="color: #fa8072;">|   |-- armv7a</span>
<span style="color: #fa8072;">|   |-- dm355-evm</span>
<span style="color: #fa8072;">|   |-- dm6446-evm</span>
<span style="color: #fa8072;">|   |-- i686</span>
<span style="color: #fa8072;">|   |-- i686-armv5te-sdk</span>
<span style="color: #fa8072;">|   |-- i686-armv7a-sdk</span>
<span style="color: #fa8072;">|   `</span>-- omap3evm
<span style="color: #fa8072;">`-- sdk</span>
</pre>


</div>

</div>

<div id="outline-container-3-1-11" class="outline-4">
<h4 id="sec-3-1-11">Build individual package recipes</h4>
<div class="outline-text-4" id="text-3-1-11">

<p>You can also look in <code>oe/arago/recipes</code> for individual package recipes
that you can bitbake. For example:
</p>


<pre class="src src-sh">bitbake curl
bitbake thhtpd
</pre>


</div>

</div>

<div id="outline-container-3-1-12" class="outline-4">
<h4 id="sec-3-1-12">build a native compiler (on dm8168) using</h4>
<div class="outline-text-4" id="text-3-1-12">




<pre class="src src-sh"><span style="color: #eedd82;">MACHINE</span>=c6a816x-evm ./arago-bitbake/bin/bitbake gcc-4.3.3(since codesourcery is using 4.3.3) or
<span style="color: #eedd82;">MACHINE</span>=c6a816x-evm ./arago-bitbake/bin/bitbake task-sdk-native
</pre>

</div>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Host and Target</h2>
<div class="outline-text-2" id="text-4">

<p>After setting up opkg respository and pointing it to apache webserver
with my vmware, now allows me easy install of python, dropbear, perl,
etc cross-complied using code sourcery.
</p>
<p class="verse">
On Host:<br/>
Install Apache sudo apt-get install apache2<br/>
After you finish building packages on host, refresh the package index on the host: &gt; bitbake package-index<br/>
add a symlink to the arago deploy/ipk directory to apache's home page <code>/var/www/oe-repo</code><br/>
<br/>
On EVM:<br/>
Determine your host IP address, and then add a src/gz  line to <code>/etc/opkg/opkg.conf</code><br/>
On the device, re-fetch the package list : opkg update<br/>
On the device, search for packages or install them<br/>
<code>opkg list '*strace*'= =opkg install strace</code><br/>
</p>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Notes</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1">Creating a Root File System for Linux on OMAP35x</h3>
<div class="outline-text-3" id="text-5-1">

<p><a href="http://processors.wiki.ti.com/index.php/Creating_a_Root_File_System_for_Linux_on_OMAP35x">http://processors.wiki.ti.com/index.php/Creating_a_Root_File_System_for_Linux_on_OMAP35x</a>
</p>

</div>

<div id="outline-container-5-1-1" class="outline-4">
<h4 id="sec-5-1-1">create the directory</h4>
<div class="outline-text-4" id="text-5-1-1">

<p>For simplicity, this note will
assume the user’s directory is “user”. The home directory is then
<code>/home/user</code>
</p>
<p>
All source code will be in the “src” directory, or
<code>/home/user/src</code>
</p>
<p>
Code will be built in the “build” directory, or
<code>/home/user/build</code>
</p>
<p>
The target root file system will be built in the “target” directory, or
<code>/home/user/target</code>
</p>
<p>
To create these directories, go to /home/user and enter
</p>


<pre class="src src-sh">[root@localhost user]# cd /home/user
[root@localhost user]# mkdir src
[root@localhost user]# mkdir build
[root@localhost user]# mkdir target
</pre>


</div>

</div>

<div id="outline-container-5-1-2" class="outline-4">
<h4 id="sec-5-1-2">Configure the Linux Kernel to Support File Systems</h4>
<div class="outline-text-4" id="text-5-1-2">

<p>The Linux kernel must be configured to support the file systems described in this note. To configure the kernel enter
“make menuconfig” on the command line.
</p>
<ul>
