src/Embedded System/Filesystem Overview.org
**** Device Node Creation
The v2.6.22.x releases default to enabling =hotplug=, =sysfs=, and =tmpfs=.
To make sure hotplug is set, type in “make menuconfig” and from the
“Main menu” use the down arrow key to scroll down to the “General
setup” entry and press the Enter key to select it. Scroll down to
“Configure standard kernel features (for small systems)” and press the
Enter key. Scroll down to “Support for hot-pluggable devices” and make
sure it is set. The Space Bar selects and de-selects options. A sample
sub-menu is shown below:

#+begin_src sh
 ┌──────── Configure standard kernel features (for small systems) ─────────┐
 │  Arrow keys navigate the menu.  <Enter> selects submenus --->.          │
 │  Highlighted letters are hotkeys.  Pressing <Y> includes, <N> excludes, │
 │  <M> modularizes features.  Press <Esc><Esc> to exit, <?> for Help, </> │
 │  for Search.  Legend: [*] built-in  [ ] excluded  <M> module  < >       │
 │ ┌─────────────────────────────────────────────────────────────────────┐ │
 │ │    --- Configure standard kernel features (for small systems)       │ │
 │ │    [*]   Enable 16-bit UID system calls                             │ │
 │ │    [ ]   Sysctl syscall support                                     │ │
 │ │    [*]   Load all symbols for debugging/ksymoops                    │ │
 │ │    [ ]     Include all symbols in kallsyms                          │ │
 │ │    [*]     Do an extra kallsyms pass                                │ │
 │ │    [*]   Support for hot-pluggable devices                          │ │
 │ │    [*]   Enable support for printk                                  │ │
 │ │    [*]   BUG() support                                              │ │
 │ │    [*]   Enable ELF core dumps                                      │ │
 │ └────v(+)─────────────────────────────────────────────────────────────┘ │
 ├─────────────────────────────────────────────────────────────────────────┤
 │                    <Select>    < Exit >    < Help >                     │
#+end_src

To ensure sysfs and tmpfs are selected, start back at the “Main menu”
and scroll down to the “File systems” option. Press Enter to select it
and then scroll down to the “Pseudo filesystems” option and press
Enter to select it. The file systems selected here should be: /proc,
/proc/sys, sysfs, and “Virtual memory file system support.” That last
one is also referred to as /tmpfs. A sample sub-menu is shown below.
#+begin_src sh
 ┌────────────────────────── Pseudo filesystems ───────────────────────────┐
 │  Arrow keys navigate the menu.  <Enter> selects submenus --->.          │
 │  Highlighted letters are hotkeys.  Pressing <Y> includes, <N> excludes, │
 │  <M> modularizes features.  Press <Esc><Esc> to exit, <?> for Help, </> │
 │  for Search.  Legend: [*] built-in  [ ] excluded  <M> module  < >       │
 │ ┌─────────────────────────────────────────────────────────────────────┐ │
 │ │    [*] /proc file system support                                    │ │
 │ │    [*]   Sysctl support (/proc/sys)                                 │ │
 │ │    [*] sysfs file system support                                    │ │
 │ │    [*] Virtual memory file system support (former shm fs)           │ │
 │ │    [ ]   Tmpfs POSIX Access Control Lists                           │ │
 │ │    < > Userspace-driven configuration filesystem (EXPERIMENTAL)     │ │
 │ │                                                                     │ │
 │ │                                                                     │ │
 │ │                                                                     │ │
 │ │                                                                     │ │
 │ └─────────────────────────────────────────────────────────────────────┘ │
 ├─────────────────────────────────────────────────────────────────────────┤
 │                    <Select>    < Exit >    < Help >                     │
 └─────────────────────────────────────────────────────────────────────────┘
#+end_src
