public_html/Embedded System/Filesystem Overview.html
<li id="sec-5-1-2-1">Device Node Creation<br/>
The v2.6.22.x releases default to enabling <code>hotplug</code>, <code>sysfs</code>, and <code>tmpfs</code>.
To make sure hotplug is set, type in “make menuconfig” and from the
“Main menu” use the down arrow key to scroll down to the “General
setup” entry and press the Enter key to select it. Scroll down to
“Configure standard kernel features (for small systems)” and press the
Enter key. Scroll down to “Support for hot-pluggable devices” and make
sure it is set. The Space Bar selects and de-selects options. A sample
sub-menu is shown below:




<pre class="src src-sh">&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472; Configure standard kernel features (<span style="color: #00ffff;">for</span> small systems) &#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
&#9474;  Arrow keys navigate the menu.  &lt;Enter&gt; selects submenus ---&gt;.          &#9474;
&#9474;  Highlighted letters are hotkeys.  Pressing &lt;Y&gt; includes, &lt;N&gt; excludes, &#9474;
&#9474;  &lt;M&gt; modularizes features.  Press &lt;Esc&gt;&lt;Esc&gt; to exit, &lt;?&gt; for Help, &lt;/&gt; &#9474;
&#9474;  for Search.  Legend: [*] built-in  [ ] excluded  &lt;M&gt; module  &lt; &gt;       &#9474;
&#9474; &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488; &#9474;
&#9474; &#9474;    --- Configure standard kernel features (<span style="color: #00ffff;">for</span> small systems)       &#9474; &#9474;
&#9474; &#9474;    [*]   Enable 16-bit UID system calls                             &#9474; &#9474;
&#9474; &#9474;    [ ]   Sysctl syscall support                                     &#9474; &#9474;
&#9474; &#9474;    [*]   Load all symbols for debugging/ksymoops                    &#9474; &#9474;
&#9474; &#9474;    [ ]     Include all symbols<span style="color: #00ffff;"> in</span> kallsyms                          &#9474; &#9474;
&#9474; &#9474;    [*]     Do an extra kallsyms pass                                &#9474; &#9474;
&#9474; &#9474;    [*]   Support for hot-pluggable devices                          &#9474; &#9474;
&#9474; &#9474;    [*]   Enable support for printk                                  &#9474; &#9474;
&#9474; &#9474;    [*]   BUG() support                                              &#9474; &#9474;
&#9474; &#9474;    [*]   Enable ELF core dumps                                      &#9474; &#9474;
&#9474; &#9492;&#9472;&#9472;&#9472;&#9472;v(+)&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496; &#9474;
&#9500;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9508;
&#9474;                    &lt;Select&gt;    &lt; Exit &gt;    &lt; Help &gt;                     &#9474;
</pre>


<p>
To ensure sysfs and tmpfs are selected, start back at the “Main menu”
and scroll down to the “File systems” option. Press Enter to select it
and then scroll down to the “Pseudo filesystems” option and press
Enter to select it. The file systems selected here should be: /proc,
/proc/sys, sysfs, and “Virtual memory file system support.” That last
one is also referred to as /tmpfs. A sample sub-menu is shown below.
</p>


<pre class="src src-sh">&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472; Pseudo filesystems &#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
&#9474;  Arrow keys navigate the menu.  &lt;Enter&gt; selects submenus ---&gt;.          &#9474;
&#9474;  Highlighted letters are hotkeys.  Pressing &lt;Y&gt; includes, &lt;N&gt; excludes, &#9474;
&#9474;  &lt;M&gt; modularizes features.  Press &lt;Esc&gt;&lt;Esc&gt; to exit, &lt;?&gt; for Help, &lt;/&gt; &#9474;
&#9474;  for Search.  Legend: [*] built-in  [ ] excluded  &lt;M&gt; module  &lt; &gt;       &#9474;
&#9474; &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488; &#9474;
&#9474; &#9474;    [*] /proc file system support                                    &#9474; &#9474;
&#9474; &#9474;    [*]   Sysctl support (/proc/sys)                                 &#9474; &#9474;
&#9474; &#9474;    [*] sysfs file system support                                    &#9474; &#9474;
&#9474; &#9474;    [*] Virtual memory file system support (former shm fs)           &#9474; &#9474;
&#9474; &#9474;    [ ]   Tmpfs POSIX Access Control Lists                           &#9474; &#9474;
&#9474; &#9474;    &lt; &gt; Userspace-driven configuration filesystem (EXPERIMENTAL)     &#9474; &#9474;
&#9474; &#9474;                                                                     &#9474; &#9474;
&#9474; &#9474;                                                                     &#9474; &#9474;
&#9474; &#9474;                                                                     &#9474; &#9474;
&#9474; &#9474;                                                                     &#9474; &#9474;
&#9474; &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496; &#9474;
&#9500;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9508;
&#9474;                    &lt;Select&gt;    &lt; Exit &gt;    &lt; Help &gt;                     &#9474;
&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
</pre>

</li>
</ul>
<ul>
<li id="sec-5-1-2-2">Configure the Linux Kernel for Root File System over NFS<br/>
