public_html/Embedded System/Filesystem Overview.html
From the “Main Menu” use the down arrow to scroll down to “File
systems” and select it by pressing the Enter key. Under “File Systems”
scroll down to “Network file systems” and select it. On this page make
sure that “NFS file system support”, “Provide NFSv3 client support”,
“Provide NFSv4 client support,” and “Root file system on NFS” are
selected. A sample sub-menu is shown below.




<pre class="src src-sh">&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472; Network File Systems &#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
 &#9474;  Arrow keys navigate the menu.  &lt;Enter&gt; selects submenus ---&gt;.          &#9474;
 &#9474;  Highlighted letters are hotkeys.  Pressing &lt;Y&gt; includes, &lt;N&gt; excludes, &#9474;
 &#9474;  &lt;M&gt; modularizes features.  Press &lt;Esc&gt;&lt;Esc&gt; to exit, &lt;?&gt; for Help, &lt;/&gt; &#9474;
 &#9474;  for Search.  Legend: [*] built-in  [ ] excluded  &lt;M&gt; module  &lt; &gt;       &#9474;
 &#9474; &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488; &#9474;
 &#9474; &#9474;    &lt;*&gt; NFS file system support                                      &#9474; &#9474;
 &#9474; &#9474;    [*]   Provide NFSv3 client support                               &#9474; &#9474;
 &#9474; &#9474;    [ ]     Provide client support for the NFSv3 ACL protocol extensi&#9474; &#9474;
 &#9474; &#9474;    [*]   Provide NFSv4 client support (EXPERIMENTAL)                &#9474; &#9474;
 &#9474; &#9474;    [ ]   Allow direct I/O on NFS files                              &#9474; &#9474;
 &#9474; &#9474;    &lt; &gt; NFS server support                                           &#9474; &#9474;
 &#9474; &#9474;    [*] Root file system on NFS                                      &#9474; &#9474;
 &#9474; &#9474;    [ ] Support for rpcbind versions 3 &amp; 4 (EXPERIMENTAL)            &#9474; &#9474;
 &#9474; &#9474;    --- Secure RPC: Kerberos V mechanism (EXPERIMENTAL)              &#9474; &#9474;
 &#9474; &#9474;    &lt; &gt; Secure RPC: SPKM3 mechanism (EXPERIMENTAL)                   &#9474; &#9474;
 &#9474; &#9492;&#9472;&#9472;&#9472;&#9472;v(+)&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496; &#9474;
 &#9500;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9508;
 &#9474;                    &lt;Select&gt;    &lt; Exit &gt;    &lt; Help &gt;                     &#9474;
 &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
</pre>

</li>
</ul>
<ul>
