src/Embedded System/Filesystem Overview.org
**** Configure the Linux Kernel for RAMDISK support
In this configuration the u-boot boot loader is used to download a
binary image to RAM and pass parameters to the kernel telling it the
root file system is on a ramdisk, where it is located, and its size.
From the “Main menu” scroll down to “Device Drivers” and select it.
Then scroll down to “Block devices” and select it. On this sub-menu
make sure “RAM disk support” is selected. For the “Default RAM disk
size” enter 16384. The RAM disk built in this note is 16M.
#+begin_src sh
 ┌───────────────────────────── Block devices ─────────────────────────────┐
 │  Arrow keys navigate the menu.  <Enter> selects submenus --->.          │
 │  Highlighted letters are hotkeys.  Pressing <Y> includes, <N> excludes, │
 │  <M> modularizes features.  Press <Esc><Esc> to exit, <?> for Help, </> │
 │  for Search.  Legend: [*] built-in  [ ] excluded  <M> module  < >       │
 │ ┌─────────────────────────────────────────────────────────────────────┐ │
 │ │    <*> Loopback device support                                      │ │
 │ │    < >   Cryptoloop Support                                         │ │
 │ │    < > Network block device support                                 │ │
 │ │    < > Low Performance USB Block driver                             │ │
 │ │    <*> RAM disk support                                             │ │
 │ │    (16)  Default number of RAM disks                                │ │
 │ │    (16384) Default RAM disk size (kbytes)                           │ │
 │ │    (1024) Default RAM disk block size (bytes)                       │ │
 │ │    < > Packet writing on CD/DVD media                               │ │
 │ │    < > ATA over Ethernet support                                    │ │
 │ └─────────────────────────────────────────────────────────────────────┘ │
 ├─────────────────────────────────────────────────────────────────────────┤
 │                    <Select>    < Exit >    < Help >                     │
 └─────────────────────────────────────────────────────────────────────────┘
#+end_src

The step above configures the kernel for build in a ramdisk. Now go
back to the “Main menu” and again select “General setup.” Scroll down
and make sure “Initial RAM filesystem and RAM disk (initramfs/initrd)
support” is selected. By default in the T.I. kernel it is.
#+begin_src sh
 ┌───────────────────────────── General setup ─────────────────────────────┐
 │  Arrow keys navigate the menu.  <Enter> selects submenus --->.          │
 │  Highlighted letters are hotkeys.  Pressing <Y> includes, <N> excludes, │
 │  <M> modularizes features.  Press <Esc><Esc> to exit, <?> for Help, </> │
 │  for Search.  Legend: [*] built-in  [ ] excluded  <M> module  < >       │
 │ ┌────^(-)─────────────────────────────────────────────────────────────┐ │
 │ │    [ ] Auditing support                                             │ │
 │ │    <*> Kernel .config support                                       │ │
 │ │    [*] Enable access to .config through /proc/config.gz             │ │
 │ │    (14) Kernel log buffer size (16 => 64KB, 17 => 128KB)            │ │
 │ │    [*] Create deprecated sysfs files                                │ │
 │ │    [ ] Kernel->user space relay support (formerly relayfs)          │ │
 │ │    [*] Initial RAM filesystem and RAM disk (initramfs/initrd) suppor│ │
 │ │    ()    Initramfs source file(s)                                   │ │
 │ │    [*] Optimize for size (Look out for broken compilers!)           │ │
 │ │    [*] Configure standard kernel features (for small systems)  ---> │ │
 │ │        Choose SLAB allocator (SLAB)  --->                           │ │
 │ └─────────────────────────────────────────────────────────────────────┘ │
 ├─────────────────────────────────────────────────────────────────────────┤
 │                    <Select>    < Exit >    < Help >                     │
 └──────────────────────────────────────────────────────── ────────────────┘
#+end_src
