src/Embedded System/Filesystem Overview.org
**** Configure the Linux Kernel for Memory Technology Devices (MTD)
To use any of the flash file systems, such as JFFS2 or CRAMFS, the MTD
layer must be configured. MTD are typically flash devices used for
storage. Configuring the individual drivers can be tricky. If a device
is CFI compliant then all that is needed is to select the CFI options.
In this example, CFI is selected, as is Intel/Sharp just in case the
part it not CFI compliant. Starting at the “Main menu” scroll down to
“Device Drivers” and select it. Scroll down to “Memory Technology
Devices (MTD) support” and select it. There are numerous options that
can/should be selected. The screen captures below are length
#+begin_src sh
 ┌──────────────── Memory Technology Device (MTD) support ─────────────────┐
 │  Arrow keys navigate the menu.  <Enter> selects submenus --->.          │
 │  Highlighted letters are hotkeys.  Pressing <Y> includes, <N> excludes, │
 │  <M> modularizes features.  Press <Esc><Esc> to exit, <?> for Help, </> │
 │  for Search.  Legend: [*] built-in  [ ] excluded  <M> module  < >       │
 │ ┌─────────────────────────────────────────────────────────────────────┐ │
 │ │    --- Memory Technology Device (MTD) support                       │ │
 │ │    [ ]   Debugging                                                  │ │
 │ │    <*>   MTD concatenating support                                  │ │
 │ │    [*]   MTD partitioning support                                   │ │
 │ │    < >     RedBoot partition table parsing                          │ │
 │ │    [*]     Command line partition table parsing                     │ │
 │ │    < >     ARM Firmware Suite partition parsing                     │ │
 │ │    ---   User Modules And Translation Layers                        │ │
 │ │    <*>   Direct char device access to MTD devices                   │ │
 │ │    ---   Common interface to block layer for MTD 'translation layers│ │
 │ │    <*>   Caching block device access to MTD devices                 │ │
 │ │    < >   FTL (Flash Translation Layer) support                      │ │
 │ │    < >   NFTL (NAND Flash Translation Layer) support                │ │
 │ │    < >   INFTL (Inverse NAND Flash Translation Layer) support       │ │
 │ │    < >   Resident Flash Disk (Flash Translation Layer) support      │ │
 │ │    < >   NAND SSFDC (SmartMedia) read only translation layer        │ │
 │ │          RAM/ROM/Flash chip drivers  --->                           │ │
 │ │          Mapping drivers for chip access  --->                      │ │
 │ │          Self-contained MTD device drivers  --->                    │ │
 │ │    <*>   NAND Device Support  --->                                  │ │
 │ │    <*>   OneNAND Device Support  --->                               │ │
 │ │          UBI - Unsorted block images  --->                          │ │
 │ └─────────────────────────────────────────────────────────────────────┘ │
 ├─────────────────────────────────────────────────────────────────────────┤
 │                    <Select>    < Exit >    < Help >                     │
 └─────────────────────────────────────────────────────────────────────────┘
#+end_src
Select the “RAM/ROM/Flash chip drivers” and ensure CFI and Intel/Sharp
are selected.
#+begin_src sh
 ┌────────────────────── RAM/ROM/Flash chip drivers ───────────────────────┐
 │  Arrow keys navigate the menu.  <Enter> selects submenus --->.          │
 │  Highlighted letters are hotkeys.  Pressing <Y> includes, <N> excludes, │
 │  <M> modularizes features.  Press <Esc><Esc> to exit, <?> for Help, </> │
 │  for Search.  Legend: [*] built-in  [ ] excluded  <M> module  < >       │
 │ ┌─────────────────────────────────────────────────────────────────────┐ │
 │ │    <*> Detect flash chips by Common Flash Interface (CFI) probe     │ │
 │ │    < > Detect non-CFI AMD/JEDEC-compatible flash chips              │ │
 │ │    [ ] Flash chip driver advanced configuration options             │ │
 │ │    <*> Support for Intel/Sharp flash chips                          │ │
 │ │    < > Support for AMD/Fujitsu flash chips                          │ │
 │ │    < > Support for ST (Advanced Architecture) flash chips           │ │
 │ │    < > Support for RAM chips in bus mapping                         │ │
 │ │    < > Support for ROM chips in bus mapping                         │ │
 │ │    < > Support for absent chips in bus mapping                      │ │
 │ │                                                                     │ │
 │ │                                                                     │ │
 │ └─────────────────────────────────────────────────────────────────────┘ │
 ├─────────────────────────────────────────────────────────────────────────┤
 │                    <Select>    < Exit >    < Help >                     │
 └─────────────────────────────────────────────────────────────────────────┘
#+end_src
Finally, go back to the MTD menu and select the “Mapping drivers for
chip access” option. This option enables the partitioning of the MTD
into four partitions: u-boot, u-boot environment, kernel, and file
system.
#+begin_src sh
 ┌──────────────────── Mapping drivers for chip access ────────────────────┐
 │  Arrow keys navigate the menu.  <Enter> selects submenus --->.          │
 │  Highlighted letters are hotkeys.  Pressing <Y> includes, <N> excludes, │
 │  <M> modularizes features.  Press <Esc><Esc> to exit, <?> for Help, </> │
 │  for Search.  Legend: [*] built-in  [ ] excluded  <M> module  < >       │
 │ ┌─────────────────────────────────────────────────────────────────────┐ │
 │ │    [ ] Support non-linear mappings of flash chips                   │ │
 │ │    < > CFI Flash device in physical memory map                      │ │
 │ │    < > CFI Flash device mapped on ARM Integrator/P720T              │ │
 │ │    <*> TI OMAP board mappings                                       │ │
 │ │    < > Map driver for platform device RAM (mtd-ram)                 │ │
 │ │                                                                     │ │
 │ │                                                                     │ │
 │ └─────────────────────────────────────────────────────────────────────┘ │
 ├─────────────────────────────────────────────────────────────────────────┤
 │                    <Select>    < Exit >    < Help >                     │
 └─────────────────────────────────────────────────────────────────────────┘
#+end_src

