public_html/Embedded System/Filesystem Overview.html
<li id="sec-5-1-2-4">Configure the Linux Kernel for Memory Technology Devices (MTD)<br/>
To use any of the flash file systems, such as JFFS2 or CRAMFS, the MTD
layer must be configured. MTD are typically flash devices used for
storage. Configuring the individual drivers can be tricky. If a device
is CFI compliant then all that is needed is to select the CFI options.
In this example, CFI is selected, as is Intel/Sharp just in case the
part it not CFI compliant. Starting at the “Main menu” scroll down to
“Device Drivers” and select it. Scroll down to “Memory Technology
Devices (MTD) support” and select it. There are numerous options that
can/should be selected. The screen captures below are length



<pre class="src src-sh">&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472; Memory Technology Device (MTD) support &#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
&#9474;  Arrow keys navigate the menu.  &lt;Enter&gt; selects submenus ---&gt;.          &#9474;
&#9474;  Highlighted letters are hotkeys.  Pressing &lt;Y&gt; includes, &lt;N&gt; excludes, &#9474;
&#9474;  &lt;M&gt; modularizes features.  Press &lt;Esc&gt;&lt;Esc&gt; to exit, &lt;?&gt; for Help, &lt;/&gt; &#9474;
&#9474;  for Search.  Legend: [*] built-in  [ ] excluded  &lt;M&gt; module  &lt; &gt;       &#9474;
&#9474; &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488; &#9474;
&#9474; &#9474;    --- Memory Technology Device (MTD) support                       &#9474; &#9474;
&#9474; &#9474;    [ ]   Debugging                                                  &#9474; &#9474;
&#9474; &#9474;    &lt;*&gt;   MTD concatenating support                                  &#9474; &#9474;
&#9474; &#9474;    [*]   MTD partitioning support                                   &#9474; &#9474;
&#9474; &#9474;    &lt; &gt;     RedBoot partition table parsing                          &#9474; &#9474;
&#9474; &#9474;    [*]     Command line partition table parsing                     &#9474; &#9474;
&#9474; &#9474;    &lt; &gt;     ARM Firmware Suite partition parsing                     &#9474; &#9474;
&#9474; &#9474;    ---   User Modules And Translation Layers                        &#9474; &#9474;
&#9474; &#9474;    &lt;*&gt;   Direct char device access to MTD devices                   &#9474; &#9474;
&#9474; &#9474;    ---   Common interface to block layer for MTD <span style="color: #ffa07a;">'translation layers&#9474; &#9474;</span>
<span style="color: #ffa07a;">&#9474; &#9474;    &lt;*&gt;   Caching block device access to MTD devices                 &#9474; &#9474;</span>
<span style="color: #ffa07a;">&#9474; &#9474;    &lt; &gt;   FTL (Flash Translation Layer) support                      &#9474; &#9474;</span>
<span style="color: #ffa07a;">&#9474; &#9474;    &lt; &gt;   NFTL (NAND Flash Translation Layer) support                &#9474; &#9474;</span>
<span style="color: #ffa07a;">&#9474; &#9474;    &lt; &gt;   INFTL (Inverse NAND Flash Translation Layer) support       &#9474; &#9474;</span>
<span style="color: #ffa07a;">&#9474; &#9474;    &lt; &gt;   Resident Flash Disk (Flash Translation Layer) support      &#9474; &#9474;</span>
<span style="color: #ffa07a;">&#9474; &#9474;    &lt; &gt;   NAND SSFDC (SmartMedia) read only translation layer        &#9474; &#9474;</span>
<span style="color: #ffa07a;">&#9474; &#9474;          RAM/ROM/Flash chip drivers  ---&gt;                           &#9474; &#9474;</span>
<span style="color: #ffa07a;">&#9474; &#9474;          Mapping drivers for chip access  ---&gt;                      &#9474; &#9474;</span>
<span style="color: #ffa07a;">&#9474; &#9474;          Self-contained MTD device drivers  ---&gt;                    &#9474; &#9474;</span>
<span style="color: #ffa07a;">&#9474; &#9474;    &lt;*&gt;   NAND Device Support  ---&gt;                                  &#9474; &#9474;</span>
<span style="color: #ffa07a;">&#9474; &#9474;    &lt;*&gt;   OneNAND Device Support  ---&gt;                               &#9474; &#9474;</span>
<span style="color: #ffa07a;">&#9474; &#9474;          UBI - Unsorted block images  ---&gt;                          &#9474; &#9474;</span>
<span style="color: #ffa07a;">&#9474; &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496; &#9474;</span>
<span style="color: #ffa07a;">&#9500;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9508;</span>
<span style="color: #ffa07a;">&#9474;                    &lt;Select&gt;    &lt; Exit &gt;    &lt; Help &gt;                     &#9474;</span>
<span style="color: #ffa07a;">&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;</span>
</pre>

<p>
Select the “RAM/ROM/Flash chip drivers” and ensure CFI and Intel/Sharp
are selected.
</p>


<pre class="src src-sh">&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472; RAM/ROM/Flash chip drivers &#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
&#9474;  Arrow keys navigate the menu.  &lt;Enter&gt; selects submenus ---&gt;.          &#9474;
&#9474;  Highlighted letters are hotkeys.  Pressing &lt;Y&gt; includes, &lt;N&gt; excludes, &#9474;
&#9474;  &lt;M&gt; modularizes features.  Press &lt;Esc&gt;&lt;Esc&gt; to exit, &lt;?&gt; for Help, &lt;/&gt; &#9474;
&#9474;  for Search.  Legend: [*] built-in  [ ] excluded  &lt;M&gt; module  &lt; &gt;       &#9474;
&#9474; &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488; &#9474;
&#9474; &#9474;    &lt;*&gt; Detect flash chips by Common Flash Interface (CFI) probe     &#9474; &#9474;
&#9474; &#9474;    &lt; &gt; Detect non-CFI AMD/JEDEC-compatible flash chips              &#9474; &#9474;
&#9474; &#9474;    [ ] Flash chip driver advanced configuration options             &#9474; &#9474;
&#9474; &#9474;    &lt;*&gt; Support for Intel/Sharp flash chips                          &#9474; &#9474;
&#9474; &#9474;    &lt; &gt; Support for AMD/Fujitsu flash chips                          &#9474; &#9474;
&#9474; &#9474;    &lt; &gt; Support for ST (Advanced Architecture) flash chips           &#9474; &#9474;
&#9474; &#9474;    &lt; &gt; Support for RAM chips<span style="color: #00ffff;"> in</span> bus mapping                         &#9474; &#9474;
&#9474; &#9474;    &lt; &gt; Support for ROM chips<span style="color: #00ffff;"> in</span> bus mapping                         &#9474; &#9474;
&#9474; &#9474;    &lt; &gt; Support for absent chips<span style="color: #00ffff;"> in</span> bus mapping                      &#9474; &#9474;
&#9474; &#9474;                                                                     &#9474; &#9474;
&#9474; &#9474;                                                                     &#9474; &#9474;
&#9474; &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496; &#9474;
&#9500;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9508;
&#9474;                    &lt;Select&gt;    &lt; Exit &gt;    &lt; Help &gt;                     &#9474;
&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
</pre>

<p>
Finally, go back to the MTD menu and select the “Mapping drivers for
chip access” option. This option enables the partitioning of the MTD
into four partitions: u-boot, u-boot environment, kernel, and file
system.
</p>


<pre class="src src-sh">&#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472; Mapping drivers for chip access &#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488;
&#9474;  Arrow keys navigate the menu.  &lt;Enter&gt; selects submenus ---&gt;.          &#9474;
&#9474;  Highlighted letters are hotkeys.  Pressing &lt;Y&gt; includes, &lt;N&gt; excludes, &#9474;
&#9474;  &lt;M&gt; modularizes features.  Press &lt;Esc&gt;&lt;Esc&gt; to exit, &lt;?&gt; for Help, &lt;/&gt; &#9474;
&#9474;  for Search.  Legend: [*] built-in  [ ] excluded  &lt;M&gt; module  &lt; &gt;       &#9474;
&#9474; &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9488; &#9474;
&#9474; &#9474;    [ ] Support non-linear mappings of flash chips                   &#9474; &#9474;
&#9474; &#9474;    &lt; &gt; CFI Flash device<span style="color: #00ffff;"> in</span> physical memory map                      &#9474; &#9474;
&#9474; &#9474;    &lt; &gt; CFI Flash device mapped on ARM Integrator/P720T              &#9474; &#9474;
&#9474; &#9474;    &lt;*&gt; TI OMAP board mappings                                       &#9474; &#9474;
&#9474; &#9474;    &lt; &gt; Map driver for platform device RAM (mtd-ram)                 &#9474; &#9474;
&#9474; &#9474;                                                                     &#9474; &#9474;
&#9474; &#9474;                                                                     &#9474; &#9474;
&#9474; &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496; &#9474;
&#9500;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9508;
&#9474;                    &lt;Select&gt;    &lt; Exit &gt;    &lt; Help &gt;                     &#9474;
&#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
</pre>


</li>
</ul>
</div>

</div>
