src/Embedded System/Filesystem Overview.org
*** Download and Build BusyBox
The source to BusyBox can be downloaded from
http://www.busybox.net/downloads. Download =busybox-1.20.2.tar.bz2= to the /home/user/src
directory. Change directory to the build directory and extract the
source code with the tar utility. 

#+begin_src sh
[root@localhost src]# cd ../build
[root@localhost build]# tar -xjvf ../src/busybox-1.20.2.tar.bz2
#+end_src

And then:
#+begin_src sh
[root@localhost build]# cd busybox-1.20.2
[root@localhost busybox-1.2.2.1]# make menuconfig
#+end_src

To build BusyBox, simply type in make at the command line. After a few
minutes the compile should be complete. When compilation is complete
install BusyBox to the target directory. The make and install commands
are show below:
#+begin_src sh
[root@localhost busybox-1.2.2.1]# make
[root@localhost busybox-1.2.2.1]# make CONFIG_PREFIX=/home/user/target install
#+end_src

