public_html/Embedded System/Filesystem Overview.html

<div id="outline-container-5-1-3" class="outline-4">
<h4 id="sec-5-1-3">Download and Build BusyBox</h4>
<div class="outline-text-4" id="text-5-1-3">

<p>The source to BusyBox can be downloaded from
<a href="http://www.busybox.net/downloads">http://www.busybox.net/downloads</a>. Download <code>busybox-1.20.2.tar.bz2</code> to the /home/user/src
directory. Change directory to the build directory and extract the
source code with the tar utility. 
</p>



<pre class="src src-sh">[root@localhost src]# cd ../build
[root@localhost build]# tar -xjvf ../src/busybox-1.20.2.tar.bz2
</pre>


<p>
And then:
</p>


<pre class="src src-sh">[root@localhost build]# cd busybox-1.20.2
[root@localhost busybox-1.2.2.1]# make menuconfig
</pre>


<p>
To build BusyBox, simply type in make at the command line. After a few
minutes the compile should be complete. When compilation is complete
install BusyBox to the target directory. The make and install commands
are show below:
</p>


<pre class="src src-sh">[root@localhost busybox-1.2.2.1]# make
[root@localhost busybox-1.2.2.1]# make <span style="color: #eedd82;">CONFIG_PREFIX</span>=/home/user/target install
</pre>


</div>

</div>
