public_html/Embedded System/Filesystem Overview.html

<div id="outline-container-5-1-4" class="outline-4">
<h4 id="sec-5-1-4">Configure the New Target Root File System</h4>
<div class="outline-text-4" id="text-5-1-4">

<p>Looking at the newly built root file system, there are only three
subdirectories of binaries and a symbolic link of bin/busybox to
linuxrc. More directories must be created before the file system can
be used. Some device nodes should be created, too.
</p>


<pre class="src src-sh">[root@localhost bin]# cd /home/user/target/
[root@localhost target]# dir
total 28
drwxr-xr-x  2 root root 4096 Nov 21 10:20 bin
lrwxrwxrwx  1 root root   11 Nov 21 10:20 linuxrc -&gt; bin/busybox
drwxr-xr-x  2 root root 4096 Nov 21 10:20 sbin
drwxr-xr-x  4 root root 4096 Nov 21 10:20 usr
</pre>

<ul>
<li>Create the dev, dev/pts, etc, etc/init.d, lib, mnt, opt, proc, root,
  sys, tmp, var, and var/log directories. Also create the device node
  for the initial console.



<pre class="src src-sh">[root@localhost target]# mkdir dev
[root@localhost target]# mknod dev/console c 5 1
[root@localhost target]# mkdir dev/pts
[root@localhost target]# mkdir etc
[root@localhost target]# mkdir etc/init.d
[root@localhost target]# mkdir lib
[root@localhost target]# mkdir mnt
[root@localhost target]# mkdir opt
[root@localhost target]# mkdir proc
[root@localhost target]# mkdir root
[root@localhost target]# mkdir sys
[root@localhost target]# mkdir tmp
[root@localhost target]# mkdir var
[root@localhost target]# mkdir var/log
</pre>

</li>
<li>To have the /proc and /dev/pts file systems mounted at boot time,
  the file etc/fstab must be created in the etc directory. 



<pre class="src src-sh">[root@localhost target]# cd etc
[root@localhost etc]# vi fstab
proc            /proc           proc    defaults        0 0
none            /dev/pts        devpts  <span style="color: #eedd82;">mode</span>=0622       0 0
</pre>

</li>
<li>The login utilities use the files group, hosts, and passwd in the
  etc directory for logging in. For now, only root needs to be defined
  in group and passwd while hosts just needs to have localhost
  defined. 



<pre class="src src-sh">[root@localhost etc]# vi group
root:x:0:root

[root@localhost etc]# vi passwd
root::0:0:root:/root:/bin/ash 

[root@localhost etc]# vi hosts
127.0.0.1       localhost
</pre>

</li>
<li>The kernel starts “/sbin/init” after it boots.Init reads the
  etc/inittab file to determine what to do at start up, shutdown, or
  when a user logs in. These inittab files can get quite complicated.
  A simple one is shown below:



<pre class="src src-sh">[root@localhost etc]# vi inittab
::sysinit:/etc/init.d/rcS 

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">/bin/ash</span>
<span style="color: #ff7f24;">#</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Start an "askfirst" shell on the serial port</span>
console::askfirst:-/bin/ash

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Stuff to do when restarting the init process</span>
::restart:/sbin/init

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Stuff to do before rebooting</span>
::ctrlaltdel:/sbin/reboot
::shutdown:/bin/umount -a -r
::shutdown:/sbin/swapoff -a
</pre>

<p>
  The “sysinit” line tells init to run the /etc/init.d/rcS script to set
  up the system. 
</p>
<p>
  A simple etc/init.d/rcS file could assume file systems existed in the
  kernel and would simply mount the mount points as needed. A more
  complicated one would test for the existence of file systems and if
  found, mount them; if not found, find ways to still get the system
  booted.
</p>
<p>
  The author has taken the etc/init.d/rcS and mdev.conf files from the
  V2.6.22.18-OMAP3 release for a simple example. The rcS script will
  test for the existence of file systems and mount them accordingly.
</p>


<pre class="src src-sh">[root@localhost etc]# vi init.d/rcS

<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">!/bin/sh</span>
<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">---------------------------------------------</span>
<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">Common settings</span>
<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">---------------------------------------------</span>
<span style="color: #eedd82;">HOSTNAME</span>=OMAP3EVM
<span style="color: #eedd82;">VERSION</span>=1.0.0

hostname $<span style="color: #eedd82;">HOSTNAME</span>

<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">---------------------------------------------</span>
<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">Prints execution status.</span>
<span style="color: #ff7f24;">#</span>
<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">arg1 : Execution status</span>
<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">arg2 : Continue (0) or Abort (1) on error</span>
<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">---------------------------------------------</span>
<span style="color: #87cefa;">status</span> ()
{
       <span style="color: #00ffff;">if</span> [ $<span style="color: #eedd82;">1</span> -eq 0 ] ; <span style="color: #00ffff;">then</span>
               <span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">"[SUCCESS]"</span>
       <span style="color: #00ffff;">else</span>
               <span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">"[FAILED]"</span>

               <span style="color: #00ffff;">if</span> [ $<span style="color: #eedd82;">2</span> -eq 1 ] ; <span style="color: #00ffff;">then</span>
                       <span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">"... System init aborted."</span>
                       <span style="color: #00ffff;">exit</span> 1
               <span style="color: #00ffff;">fi</span>
       <span style="color: #00ffff;">fi</span>

}

<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">---------------------------------------------</span>
<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">Get verbose</span>
<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">---------------------------------------------</span>
<span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">""</span>
<span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">"    System initialization..."</span>
<span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">""</span>
<span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">"    Hostname       : $HOSTNAME"</span>
<span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">"    Filesystem     : v$VERSION"</span>
<span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">""</span>
<span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">""</span>
<span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">"    Kernel release : `uname -s` `uname -r`"</span>
<span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">"    Kernel version : `uname -v`"</span>
<span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">""</span>


<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">---------------------------------------------</span>
<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">MDEV Support</span>
<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">(Requires sysfs support in the kernel)</span>
<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">---------------------------------------------</span>
<span style="color: #b0c4de;">echo</span> -n <span style="color: #ffa07a;">" Mounting /proc             : "</span>
mount -n -t proc /proc /proc
status $<span style="color: #eedd82;">?</span> 1

<span style="color: #b0c4de;">echo</span> -n <span style="color: #ffa07a;">" Mounting /sys              : "</span>
mount -n -t sysfs sysfs /sys
status $<span style="color: #eedd82;">?</span> 1

<span style="color: #b0c4de;">echo</span> -n <span style="color: #ffa07a;">" Mounting /dev              : "</span>
mount -n -t tmpfs mdev /dev
status $<span style="color: #eedd82;">?</span> 1

<span style="color: #b0c4de;">echo</span> -n <span style="color: #ffa07a;">" Mounting /dev/pts          : "</span>
mkdir /dev/pts
mount -t devpts devpts /dev/pts
status $<span style="color: #eedd82;">?</span> 1

<span style="color: #b0c4de;">echo</span> -n <span style="color: #ffa07a;">" Enabling hot-plug          : "</span>
<span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">"/sbin/mdev"</span> &gt; /proc/sys/kernel/hotplug
status $<span style="color: #eedd82;">?</span> 0

<span style="color: #b0c4de;">echo</span> -n <span style="color: #ffa07a;">" Populating /dev            : "</span>
mkdir /dev/input
mkdir /dev/snd

mdev -s
status $<span style="color: #eedd82;">?</span> 0

<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">---------------------------------------------</span>
<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">Disable power management</span>
<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">(Requires sysfs support in the kernel)</span>
<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">---------------------------------------------</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">echo -n " Disabling Power mgmt       : "</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">echo -n "1" &gt; /sys/power/cpuidle_deepest_state</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">status $? 1</span>

<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">---------------------------------------------</span>
<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">Turn off LCD after 1 hour of inactivity</span>
<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">(Requires sysfs support in the kernel)</span>
<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">---------------------------------------------</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">echo -n " Turn off LCD after 1 hour  : "</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">echo -n "3600" &gt; /sys/power/fb_timeout_value</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">status $? 1</span>


<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">---------------------------------------------</span>
<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">Mount the default file systems</span>
<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">---------------------------------------------</span>
<span style="color: #b0c4de;">echo</span> -n <span style="color: #ffa07a;">" Mounting other filesystems : "</span>
mount -a
status $<span style="color: #eedd82;">?</span> 0


<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">---------------------------------------------</span>
<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">Set PATH</span>
<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">---------------------------------------------</span>
<span style="color: #b0c4de;">export</span> <span style="color: #eedd82;">PATH</span>=/bin:/sbin:/usr/bin:/usr/sbin:/usr/local/bin


<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">---------------------------------------------</span>
<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">Start other daemons</span>
<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">---------------------------------------------</span>
<span style="color: #b0c4de;">echo</span> -n <span style="color: #ffa07a;">" Starting syslogd           : "</span>
/sbin/syslogd
status $<span style="color: #eedd82;">?</span> 0

<span style="color: #b0c4de;">echo</span> -n <span style="color: #ffa07a;">" Starting telnetd           : "</span>
/usr/sbin/telnetd
status $<span style="color: #eedd82;">?</span> 0


<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">---------------------------------------------</span>
<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">Done!</span>
<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">---------------------------------------------</span>
<span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">""</span>
<span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">"System initialization complete."</span>


<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">---------------------------------------------</span>
<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">Start demo app</span>
<span style="color: #ff7f24;">#   </span><span style="color: #ff7f24;">---------------------------------------------</span>
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">if [[ -x /etc/init.d/demo_start ]]; then</span>
<span style="color: #ff7f24;">#       </span><span style="color: #ff7f24;">echo " Starting Demo Application..."</span>
<span style="color: #ff7f24;">#       </span><span style="color: #ff7f24;">/etc/init.d/demo_start &amp;</span>
<span style="color: #ff7f24;">#       </span><span style="color: #ff7f24;">sleep 5</span>
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">fi</span>
Please note that<span style="color: #00ffff;"> in</span> more recent kernels (2.6.29 and newer) the sysfs entries shown above to disable power management and control the LCD inactivity timeout shown above have been removed. For latest details on using OMAP Power Management<span style="color: #00ffff;"> in</span> Linux please refer to this article.

To automatically mount the debugfs on start-up the following can be added to the above rcS file. Please note that the debugfs needs to be selected<span style="color: #00ffff;"> in</span> the kernel configuration and built into the kernel before you can mount it. The below script checks to see if the debugfs is supported by the kernel before attempting to mount the file-system. To enable the debugfs run <span style="color: #ffa07a;">"make menuconfig"</span> and go to <span style="color: #ffa07a;">"Kernel Hacking"</span> and select <span style="color: #ffa07a;">"Debug Filesystem"</span>.

cat /proc/filesystems | grep -q debugfs
<span style="color: #00ffff;">if</span> [ $<span style="color: #eedd82;">?</span> -eq 0 ] ; <span style="color: #00ffff;">then</span>
        <span style="color: #b0c4de;">echo</span> -n <span style="color: #ffa07a;">" Mounting /debug             : "</span>
        mount -n -t debugfs none /debug
        status $<span style="color: #eedd82;">?</span> 1
<span style="color: #00ffff;">fi</span>
</pre>


<p>  
  To automatically mount the debugfs on start-up the following can be
  added to the above rcS file. Please note that the debugfs needs to
  be selected in the kernel configuration and built into the kernel
  before you can mount it. The below script checks to see if the
  debugfs is supported by the kernel before attempting to mount the
  file-system. To enable the debugfs run "make menuconfig" and go to
  "Kernel Hacking" and select "Debug Filesystem".
</p>


<pre class="src src-sh">cat /proc/filesystems | grep -q debugfs
<span style="color: #00ffff;">if</span> [ $<span style="color: #eedd82;">?</span> -eq 0 ] ; <span style="color: #00ffff;">then</span>
        <span style="color: #b0c4de;">echo</span> -n <span style="color: #ffa07a;">" Mounting /debug             : "</span>
        mount -n -t debugfs none /debug
        status $<span style="color: #eedd82;">?</span> 1
<span style="color: #00ffff;">fi</span>
</pre>

<p>
  After saving the file, change its access permissions so that it is executable for all.
</p>


<pre class="src src-sh">[root@localhost etc]# vi mdev.conf

audio       0:5 0666
console     0:5 0600
control.*   0:0 0660 @/bin/mv /dev/$<span style="color: #eedd82;">MDEV</span> /dev/snd/
dsp         0:5 0666
event.*     0:0 0600 @/bin/mv /dev/$<span style="color: #eedd82;">MDEV</span> /dev/input/
fb          0:5 0666
nfs         0:5 0770
null        0:0 0777
pcm.*       0:0 0660 @/bin/mv /dev/$<span style="color: #eedd82;">MDEV</span> /dev/snd/
rtc         0:0 0666
tty         0:5 0660
tty0*       0:5 0660
tty1*       0:5 0660
tty2*       0:5 0660
tty3*       0:5 0660
tty4*       0:5 0660
tty5*       0:5 0660
tty6*       0:5 0660
ttyS*       0:5 0640
urandom     0:0 0444
zero        0:0 0666
</pre>

</li>
</ul>



</div>

</div>
