src/Embedded System/Filesystem Overview.org
*** Add the Shared Libraries Applications will Require
In the Code Sourcery tool chain, most of the libraries are found in
the =/home/testbed/CodeSourcery/Sourcery_G++_Lite/arm-none-linux-gnueabi/libc/lib= directory. Simply
copy these files to the root file system, maintaining symbolic links
and then strip out unneeded debug information.

#+begin_src sh
[root@localhost user]# cd /home/user/target/lib
[root@localhost lib]# cp –r /home/testbed/CodeSourcery/Sourcery_G++_Lite/arm-none-linux-gnueabi/libc/lib/* .
[root@localhost lib]# arm-none-linux-gnueabi-strip *
#+end_src
Some libraries might be in other directories in the tool chain; those
would have to be found on a “trial and error” basis when applications
do not load because of a missing shared library.
*** Mounting the Root File System over NFS
*** Enhancing the Root File System
Any drivers built as modules need to be added to the target root file
system
#+begin_src sh
[root@localhost 2.6_kernel]# make modules
[root@localhost 2.6_kernel]# make INSTALL_MOD_PATH=/home/user/target modules_install
#+end_src

One problem still exists – the modules still have debug information so
they are larger than they need to be. When debug information is no
longer needed, use the arm-none-linux-gnueabi-strip utility to remove
it. 
#+begin_src sh
[root@localhost user]# cd /home/user/target/lib/modules
[root@localhost modules]# arm-none-linux-gnueabi-strip `find . –name “*.ko”`
#+end_src
