public_html/Embedded System/Filesystem Overview.html

<div id="outline-container-5-1-5" class="outline-4">
<h4 id="sec-5-1-5">Add the Shared Libraries Applications will Require</h4>
<div class="outline-text-4" id="text-5-1-5">

<p>In the Code Sourcery tool chain, most of the libraries are found in
the <code>/home/testbed/CodeSourcery/Sourcery_G++_Lite/arm-none-linux-gnueabi/libc/lib</code> directory. Simply
copy these files to the root file system, maintaining symbolic links
and then strip out unneeded debug information.
</p>



<pre class="src src-sh">[root@localhost user]# cd /home/user/target/lib
[root@localhost lib]# cp &#8211;r /home/testbed/CodeSourcery/Sourcery_G++_Lite/arm-none-linux-gnueabi/libc/lib/* .
[root@localhost lib]# arm-none-linux-gnueabi-strip *
</pre>

<p>
Some libraries might be in other directories in the tool chain; those
would have to be found on a “trial and error” basis when applications
do not load because of a missing shared library.
</p></div>

</div>

<div id="outline-container-5-1-6" class="outline-4">
<h4 id="sec-5-1-6">Mounting the Root File System over NFS</h4>
<div class="outline-text-4" id="text-5-1-6">

</div>

</div>

<div id="outline-container-5-1-7" class="outline-4">
<h4 id="sec-5-1-7">Enhancing the Root File System</h4>
<div class="outline-text-4" id="text-5-1-7">

<p>Any drivers built as modules need to be added to the target root file
system
</p>


<pre class="src src-sh">[root@localhost 2.6_kernel]# make modules
[root@localhost 2.6_kernel]# make <span style="color: #eedd82;">INSTALL_MOD_PATH</span>=/home/user/target modules_install
</pre>


<p>
One problem still exists – the modules still have debug information so
they are larger than they need to be. When debug information is no
longer needed, use the arm-none-linux-gnueabi-strip utility to remove
it. 
</p>


<pre class="src src-sh">[root@localhost user]# cd /home/user/target/lib/modules
[root@localhost modules]# arm-none-linux-gnueabi-strip <span style="color: #fa8072;">`find . &#8211;name &#8220;*.ko&#8221;`</span>
</pre>

</div>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-09-09 15:16:53 HKT</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator">Org version 7.8.09 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
